questions_source = [
    (
        'Какой город является столицей Франции?',
        ['Рим', 'Лондон', 'Париж', 'Берлин'],
        'Париж'
    ),
    (
        'Какое животное является символом России?',
        ['Медведь', 'Орел', 'Волк', 'Лиса'],
        'Орел'
    ),
    (
        'Как называется наибольшая планета Солнечной системы?',
        ['Венера', 'Марс', 'Юпитер', 'Сатурн'],
        'Юпитер'
    ),
    (
        'Какое количество штатов в США?',
        ['50', '25', '30', '40'],
        '50'
    ),
    (
        'Кто написал \"Войну и мир\"?',
        ['Фёдор Достоевский', 'Марк Твен', 'Лев Толстой', 'Александр Пушкин'],
        'Лев Толстой'
    ),
    (
        'Какой год был назван международным годом Джаза?',
        ['2019', '2020', '2021', '2022'],
        '2020'
    ),
    (
        'Какой спортсмен выиграл больше всего золотых медалей на Олимпийских играх?',
        ['Майкл Фелпс', 'Усэйн Болт', 'Уилльямс сестры (Серена и Винус)', 'Михаэль Шумахер'],
        'Майкл Фелпс'
    ),
    (
        'Какой язык является самым распространенным в мире?',
        ['Английский', 'Китайский', 'Испанский', 'Русский'],
        'Китайский'
    ),
    (
        'Какая страна является самой большой по площади?',
        ['Китай', 'Россия', 'Канада', 'США'],
        'Россия'
    ),
    (
        'Как зовут главного героя романа \"Мастер и Маргарита\"?',
        ['Иван Иванович', 'Михаил Александрович', 'Григорий Александрович', 'Воланд'],
        'Григорий Александрович'
    ),
    (
        'Какой газ является основным компонентом атмосферы земли?',
        ['Кислород', 'Азот', 'Углекислый газ', 'Сероводород'],
        'Азот'
    ),
    (
        'Какая планета Солнечной системы находится ближе всего к солнцу?',
        ['Меркурий', 'Венера', 'Земля', 'Марс'],
        'Меркурий'
    ),
    (
        'Как называется самая высокая гора в мире?',
        ['Эверест', 'Килиманджаро', 'Аконкагуа', 'Манаслу'],
        'Эверест'
    ),
    (
        'Кто написал \"Гарри Поттера\"?',
        ['Джордж Мартин', 'Джоан Роулинг', 'Джон Толкин', 'Джордж Оруэлл'],
        'Джоан Роулинг'
    ),
    (
        'Кто изображен на долларовой купюре США?',
        ['Авраам Линкольн', 'Джордж Вашингтон', 'Томас Джефферсон', 'Бенджамин Франклин'],
        'Бенджамин Франклин'
    )
]
